app/Controllers/Admin/Codes.php

SELECT `wallet_codes`.*, `users`.`username` as `used_by_name`
FROM `wallet_codes`
LEFT JOIN `users` ON `users`.`id` = `wallet_codes`.`used_by`
ORDER BY `wallet_codes`.`created_at` DESC
---
    public function index()
    {
        if ($r = $this->checkAdmin()) return $r;

        $codeModel = new WalletCodeModel();
        $codes     = $codeModel->select('wallet_codes.*, users.username as used_by_name')
                               ->join('users', 'users.id = wallet_codes.used_by', 'left')
                               ->orderBy('wallet_codes.created_at', 'DESC')
                               ->findAll();