app/Controllers/Auth.php

    public function login()
    {
        if ($this->request->getMethod() === 'POST') {
            $email    = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $userModel = new UserModel();
            $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'fenosoaraininoro@gmail.com'
 LIMIT 1