app/Controllers/Dashboard.php

    public function index()
    {
        if (!session()->get('logged_in')) return redirect()->to('/login');

        $userId       = session()->get('user_id');
        $profileModel = new UserProfileModel();
        $profile      = $profileModel->where('user_id', $userId)->first();

        // IMC
        $imc = null; $imcLabel = null; $imcColor = null;
        if ($profile && $profile['height'] > 0) {
            $h   = $profile['height'] / 100;
            $imc = round($profile['weight'] / ($h * $h), 1);
            if      ($imc < 18.5) { $imcLabel = 'Insuffisance pondérale'; $imcColor = 'blue'; }
            elseif  ($imc < 25)   { $imcLabel = 'Poids normal';           $imcColor = 'green'; }
            elseif  ($imc < 30)   { $imcLabel = 'Surpoids';               $imcColor = 'orange'; }
            else                  { $imcLabel = 'Obésité';                $imcColor = 'red'; }
        }

        // Wallet
        $walletModel = new WalletModel();
        $walletModel->initForUser($userId);
        $wallet = $walletModel->getByUser($userId);

        // Commandes de l'utilisateur
        $orderModel  = new OrderModel();
        $orders      = $orderModel->where('user_id', $userId)
                                  ->orderBy('ordered_at', 'DESC')
                                  ->findAll();
---
SELECT *
FROM `user_profiles`
WHERE `user_id` = '7'
 LIMIT 1
SELECT *
FROM `orders`
WHERE `user_id` = '7'
ORDER BY `ordered_at` DESC


        // Codes utilisés
        $codeModel = new WalletCodeModel();
        $usedCodes = $codeModel->where('used_by', $userId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `wallet_codes`
WHERE `used_by` = '7'