app/Controllers/ExportPdf.php

SELECT *
FROM `regimes`
WHERE `regimes`.`id` = 1
SELECT *
FROM `user_profiles`
WHERE `user_id` = '1'
 LIMIT 1
---
    public function preview(int $regimeId)
    {
        if (!session()->get('logged_in')) return redirect()->to('/login');

        $userId = session()->get('user_id');

        // Vérifier que le régime est acheté
        $orderModel = new OrderModel();
        if (!$orderModel->hasOrdered($userId, $regimeId)) {
            return redirect()->to('/suggestions')->with('error', 'Vous devez acheter ce régime pour l\'exporter.');
        }

        $regime     = (new RegimeModel())->find($regimeId);
        $activities = (new SportActivityModel())->getByGoal($regime['goal']);
        $profile    = (new UserProfileModel())->where('user_id', $userId)->first();