app/Controllers/Profile.php

SELECT *
FROM `user_profiles`
WHERE `user_id` = '1'
 LIMIT 1
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $profileModel = new UserProfileModel();
        $profile = $profileModel->where('user_id', session()->get('user_id'))->first();

SELECT *
FROM `user_profiles`
WHERE `user_id` = '7'
 LIMIT 1
UPDATE `user_profiles` SET `goal` = 'lose'
WHERE `user_profiles`.`id` IN ('7')
---
    public function saveGoal()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $rules = ['goal' => 'required|in_list[gain,lose,ideal]'];

        if (!$this->validate($rules)) {
            return redirect()->to('/profile')->with('error', 'Objectif invalide.');
        }

        $profileModel = new UserProfileModel();
        $profile = $profileModel->where('user_id', session()->get('user_id'))->first();

        if ($profile) {
            $profileModel->update($profile['id'], [
                'goal' => $this->request->getPost('goal'),
            ]);