app/Controllers/Suggestions.php

    public function index()
    {
        if (!session()->get('logged_in')) return redirect()->to('/login');

        $userId       = session()->get('user_id');
        $profileModel = new UserProfileModel();
        $profile      = $profileModel->where('user_id', $userId)->first();

        // Pas d'objectif défini → rediriger vers profil
        if (!$profile || !$profile['goal']) {
            return redirect()->to('/profile')->with('error', 'Veuillez d\'abord choisir un objectif.');
        }

        $goal = $profile['goal'];

        // Calcul IMC
        $heightM = $profile['height'] / 100;
        $imc     = round($profile['weight'] / ($heightM * $heightM), 1);

        // Récupérer régimes et activités selon objectif
        $regimes    = (new RegimeModel())->getByGoal($goal);
        $activities = (new SportActivityModel())->getByGoal($goal);

        // Portefeuille
        $walletModel = new WalletModel();
        $walletModel->initForUser($userId);
        $wallet = $walletModel->getByUser($userId);

        // Commandes déjà passées
        $orderModel   = new OrderModel();
        $orderedIds   = array_column(
            (new OrderModel())->where('user_id', $userId)->findAll(),
            'regime_id'
        );
---
SELECT *
FROM `user_profiles`
WHERE `user_id` = '1'
 LIMIT 1
SELECT *
FROM `orders`
WHERE `user_id` = '1'

    public function buy()
    {
        if (!session()->get('logged_in')) return redirect()->to('/login');

        $userId    = session()->get('user_id');
        $regimeId  = (int) $this->request->getPost('regime_id');

        $regimeModel = new RegimeModel();
        $regime = $regimeModel->find($regimeId);
---
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = 1

        ]);

        // Enregistrer la commande
        $orderModel->insert([
            'user_id'    => $userId,
            'regime_id'  => $regimeId,
            'price_paid' => $price,
        ]);
---
INSERT INTO `orders` (`user_id`, `regime_id`, `price_paid`) VALUES ('1', 1, '29.99')