app/Controllers/Wallet.php

SELECT *
FROM `orders`
WHERE `user_id` = '1'
ORDER BY `ordered_at` DESC
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = '3'
SELECT *
FROM `wallet_codes`
WHERE `used_by` = '1'
ORDER BY `used_at` DESC
---
    public function index()
    {
        if (!session()->get('logged_in')) return redirect()->to('/login');

        $userId      = session()->get('user_id');
        $walletModel = new WalletModel();
        $walletModel->initForUser($userId);
        $wallet = $walletModel->getByUser($userId);

        // Historique des commandes
        $orderModel = new OrderModel();
        $orders     = $orderModel->where('user_id', $userId)
                                 ->orderBy('ordered_at', 'DESC')
                                 ->findAll();

        // Enrichir les commandes avec le nom du régime
        $regimeModel = new RegimeModel();
        foreach ($orders as &$order) {
            $regime = $regimeModel->find($order['regime_id']);
            $order['regime_name'] = $regime ? $regime['name'] : 'Régime supprimé';
        }
        unset($order);

        // Historique des codes utilisés
        $codeModel = new WalletCodeModel();
        $usedCodes = $codeModel->where('used_by', $userId)
                               ->orderBy('used_at', 'DESC')
                               ->findAll();