app/Models/OrderModel.php

    public function hasOrdered(int $userId, int $regimeId): bool
    {
        return $this->where('user_id', $userId)
                    ->where('regime_id', $regimeId)
                    ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `user_id` = 1
AND `regime_id` = 1