app/Models/RegimeModel.php

SELECT *
FROM `regimes`
WHERE `goal` = 'gain'
---
    public function getByGoal(string $goal): array
    {
        return $this->where('goal', $goal)->findAll();