app/Models/SettingModel.php

SELECT *
FROM `settings`
WHERE `key_name` = 'max_recharge'
 LIMIT 1
---
    public function getValue(string $key, $default = null)
    {
        $row = $this->where('key_name', $key)->first();