app/Models/SportActivityModel.php

SELECT *
FROM `sport_activities`
WHERE `goal` = 'gain'
---
    public function getByGoal(string $goal): array
    {
        return $this->where('goal', $goal)->findAll();