app/Models/WalletModel.php

SELECT *
FROM `wallets`
WHERE `user_id` = 1
 LIMIT 1
---
    public function getByUser(int $userId): ?array
    {
        return $this->where('user_id', $userId)->first();

INSERT INTO `wallets` (`user_id`, `balance`, `is_gold`) VALUES (7, 0, 0)
---
    public function initForUser(int $userId): void
    {
        if (!$this->getByUser($userId)) {
            $this->insert(['user_id' => $userId, 'balance' => 0.00, 'is_gold' => false]);